hello world

123123

123123

In [10]:
import pandas as pd

In [13]:
df = pd.DataFrame(columns=['name','age','heght'])
df

Empty DataFrame
Columns: [name, age, heght]
Index: []

In [15]:
df.loc[0]=['aaa','10','175']
df

  name age heght
0  aaa  10   175

In [21]:
df.loc[]=['aWWa','10','175','90']
df

   name age heght weight
0   aaa  10   175     60
1   aaa  10   175    990
2  aWWa  10   175     90

In [18]:
df['weight'] = ['60','990']
df

  name age heght weight
0  aaa  10   175     60
1  aaa  10   175    990

In [22]:
df.loc[0]=['aGA','10','175','90']
df

   name age heght weight
0   aGA  10   175     90
1   aaa  10   175    990
2  aWWa  10   175     90

In [24]:
df=df.drop(['weight'],axis=1)
df

   name age heght
0   aGA  10   175
1   aaa  10   175
2  aWWa  10   175

In [26]:
df=df.drop([0])
df

   name age heght
1   aaa  10   175
2  aWWa  10   175

In [32]:
df['name'][1]='allen'
df

    name age heght
1  allen  10   175
2   aWWa  10   175

In [33]:
df.to_csv(r'./pandas_practice.csv',index=0, encoding = 'utf-8')

In [34]:
df2=pd.read_csv(r'./pandas_practice.csv')
df2

    name  age  heght
0  allen   10    175
1   aWWa   10    175

In [35]:
new_df = pd.DataFrame([['Allen','22','175'],['ted','25','180']],columns = ['name','age','heght'])
new_df

    name age heght
0  Allen  22   175
1    ted  25   180

In [36]:
df

    name age heght
1  allen  10   175
2   aWWa  10   175

In [38]:
df = df.append(new_df)
df

    name age heght
1  allen  10   175
2   aWWa  10   175
0  Allen  22   175
1    ted  25   180